# Задача 14: Требуется вывести все целые степени двойки (т.е. числа вида 2k), не превосходящие числа N.

# N = int(input('Введите число: 'b ))
# count = 1
# while (2 ** count) < N:
#     print(count)
#     count+=1
# else:
#     print('стоп')
